Revit 2026 API

# WallUtils Class

---

General Wall utility methods

SystemObject Autodesk.Revit.DBWallUtils

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class WallUtils
```
```vb
Public NotInheritable Class WallUtils
```
```cpp
public ref class WallUtils abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type WallUtils = class end
```

The WallUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AllowWallJoinAtEnd | Allows the wall's end to join to other walls. If that end is near other walls it will become joined as a result. |
|  | DisallowWallJoinAtEnd | Sets the wall's end not to join to other walls. |
|  | IsWallJoinAllowedAtEnd | Identifies if the indicated end of the wall allows joins or not. |

#### Reference

Autodesk.Revit.DB Namespace